{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from dotenv import load_dotenv\n",
    "import os"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "load_dotenv()\n",
    "URI = os.environ.get('NEO4J_URI')\n",
    "USERNAME = os.environ.get('NEO4J_USERNAME')\n",
    "PASSWORD = os.environ.get('NEO4J_PASSWORD')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(URI, auth=(USERNAME, PASSWORD))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "def run_query(query, params={}):\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, params)\n",
    "        return result.data()  # Returns list of dictionaries\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.AggregationSkippedNull} {category: UNRECOGNIZED} {title: The query contains an aggregation function that skips null values.} {description: null value eliminated in set function.} {position: None} for query: '\\n    MATCH (p:paper)-[:presented]->(ce:ConferenceEdition) \\n    OPTIONAL MATCH (p)<-[c:cite]-(:paper) \\n    WITH ce, p, COUNT(c) AS cnt \\n    ORDER BY ce, cnt DESC\\n    WITH ce, COLLECT({paper: p, cite_nb: cnt}) AS paper_cnt \\n    RETURN ce.confwsEditionId AS confId, paper_cnt[..3] AS top3\\n'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "768b87bb-8a18-4d9c-a161-4d483c776bcf2021\n",
      "Robust Point Cloud Registration Framework Based on Deep Graph Matching 1\n",
      "I3Net: Implicit Instance-Invariant Network for Adapting One-Stage Object Detectors 1\n",
      "Masked Autoencoders Are Scalable Vision Learners 1\n",
      "------------------------------------------\n",
      "3f2626a8-9d78-42ca-9e0d-4b853b59cdcc2020\n",
      "Robotic Grasping of Fully-Occluded Objects using RF Perception 1\n",
      "Semantic Linking Maps for Active Visual Object Search 1\n",
      "Semantic and Geometric Modeling with Neural Message Passing in 3D Scene Graphs for Hierarchical Mechanical Search 0\n",
      "------------------------------------------\n",
      "a0edb93b-1e95-4128-a295-6b1659149cef2024\n",
      "ZeroG: Investigating Cross-dataset Zero-shot Transferability in Graphs 0\n",
      "------------------------------------------\n",
      "d2e111a6-dd60-474c-ae8a-2b5773cca07d2023\n",
      "Automatic Program Repair via Learning Edits on Sequence Code Property Graph 0\n",
      "------------------------------------------\n",
      "768b87bb-8a18-4d9c-a161-4d483c776bcf2020\n",
      "Semi-Supervised Semantic Segmentation With Cross-Consistency Training 1\n",
      "Creating Something From Nothing: Unsupervised Knowledge Distillation for Cross-Modal Hashing 1\n",
      "Learning 3D Semantic Scene Graphs From 3D Indoor Reconstructions 0\n",
      "------------------------------------------\n",
      "ef00f0de-a7e5-443a-9a2d-c78502a4b5982018\n",
      "Named Property Graphs 0\n",
      "------------------------------------------\n",
      "b198f59e-0da6-4b35-b995-a02322b9dada2022\n",
      "CPGCN: Collaborative Property-aware Graph Convolutional Networks for Service Recommendation 0\n",
      "------------------------------------------\n",
      "0d6f7fba-7092-46b3-8039-93458dba736b2023\n",
      "Graph Based Semantic Ensemble of Riemannian Neural Structured Learning for BCI-EEG Signal Classification 0\n",
      "------------------------------------------\n",
      "a0edb93b-1e95-4128-a295-6b1659149cef2019\n",
      "A Representation Learning Framework for Property Graphs 0\n",
      "------------------------------------------\n",
      "a9cc0bba-1308-4d4b-a37e-d2fcfaccb0b52024\n",
      "Semantic Understanding in Natural Language Processing: Application of Graph Neural Networks in Relationship Extraction 0\n",
      "------------------------------------------\n",
      "a0edb93b-1e95-4128-a295-6b1659149cef2022\n",
      "GPPT: Graph Pre-training and Prompt Tuning to Generalize Graph Neural Networks 1\n",
      "KPGT: Knowledge-Guided Pre-training of Graph Transformer for Molecular Property Prediction 0\n",
      "------------------------------------------\n",
      "768b87bb-8a18-4d9c-a161-4d483c776bcf2018\n",
      "Auto-Encoding Scene Graphs for Image Captioning 2\n",
      "Attentive Relational Networks for Mapping Images to Scene Graphs 1\n",
      "3D-SIS: 3D Semantic Instance Segmentation of RGB-D Scans 1\n",
      "------------------------------------------\n",
      "fc0a208c-acb7-47dc-a0d4-af8190e21d292018\n",
      "Pseudo-task Augmentation: From Deep Multitask Learning to Intratask Sharing - and Back 1\n",
      "------------------------------------------\n",
      "f51ff783-cdff-4e22-94fb-28e6336d17b32020\n",
      "I Know What You Asked: Graph Path Learning using AMR for Commonsense Reasoning 1\n",
      "------------------------------------------\n",
      "fc0a208c-acb7-47dc-a0d4-af8190e21d292015\n",
      "Learning Transferable Features with Deep Adaptation Networks 6\n",
      "------------------------------------------\n",
      "768b87bb-8a18-4d9c-a161-4d483c776bcf2016\n",
      "Volumetric and Multi-view CNNs for Object Classification on 3D Data 4\n",
      "------------------------------------------\n",
      "6bf48d72-eba2-4918-b9a0-1532800625132016\n",
      "Multimedia Social Network Modeling: A Proposal 1\n",
      "------------------------------------------\n",
      "7654260e-79f9-45c5-9663-d72027cf88f32019\n",
      "Domain Adaptation for Semantic Segmentation With Maximum Squares Loss 3\n",
      "SceneGraphNet: Neural Message Passing for 3D Indoor Scene Augmentation 1\n",
      "------------------------------------------\n",
      "fc0a208c-acb7-47dc-a0d4-af8190e21d292011\n",
      "A Three-Way Model for Collective Learning on Multi-Relational Data 3\n",
      "------------------------------------------\n",
      "bdc2e585-4e48-4e36-8af1-6d859763d4052017\n",
      "HARP: Hierarchical Representation Learning for Networks 1\n",
      "------------------------------------------\n",
      "fc0a208c-acb7-47dc-a0d4-af8190e21d292020\n",
      "A Simple Framework for Contrastive Learning of Visual Representations 10\n",
      "------------------------------------------\n",
      "1e33b3be-b2ab-46e9-96e8-d4eb4bad6e442019\n",
      "Low-resource Deep Entity Resolution with Transfer and Active Learning 2\n",
      "------------------------------------------\n",
      "764e3630-ddac-4c21-af4b-9d32ffef082e2014\n",
      "Profiling and mining RDF data with ProLOD++ 1\n",
      "------------------------------------------\n",
      "bdc2e585-4e48-4e36-8af1-6d859763d4052020\n",
      "Revisiting Graph based Collaborative Filtering: A Linear Residual Graph Convolutional Network Approach 2\n",
      "------------------------------------------\n",
      "d9720b90-d60b-48bc-9df8-87a30b9a60dd2017\n",
      "PointNet++: Deep Hierarchical Feature Learning on Point Sets in a Metric Space 4\n",
      "------------------------------------------\n",
      "768b87bb-8a18-4d9c-a161-4d483c776bcf2017\n",
      "ScanNet: Richly-Annotated 3D Reconstructions of Indoor Scenes 6\n",
      "Visual Translation Embedding Network for Visual Relation Detection 4\n",
      "------------------------------------------\n",
      "8dce23a9-44e0-4381-a39e-2acc1edff7002022\n",
      "Why do Semantically Unrelated Categories Appear in the Same Session?: A Demand-aware Method 1\n",
      "------------------------------------------\n",
      "e6904c24-9546-4135-8344-e3999e3755582014\n",
      "Detecting Logic Vulnerabilities in E-commerce Applications 1\n",
      "------------------------------------------\n",
      "bdc2e585-4e48-4e36-8af1-6d859763d4052016\n",
      "Deep Neural Networks for Learning Graph Representations 1\n",
      "------------------------------------------\n",
      "7431ff67-91dc-41fa-b322-1b1ca657025f2012\n",
      "Latent topics in graph-structured data 1\n",
      "------------------------------------------\n",
      "7431ff67-91dc-41fa-b322-1b1ca657025f2015\n",
      "GraRep: Learning Graph Representations with Global Structural Information 4\n",
      "------------------------------------------\n",
      "a0edb93b-1e95-4128-a295-6b1659149cef2016\n",
      "Structural Deep Network Embedding 2\n",
      "------------------------------------------\n",
      "e07422f9-c065-40c3-a37b-75e98dce79fe2019\n",
      "Semi-Supervised Graph Classification: A Hierarchical Graph Perspective 1\n",
      "------------------------------------------\n",
      "d9720b90-d60b-48bc-9df8-87a30b9a60dd2016\n",
      "Integrated perception with recurrent multi-task neural networks 2\n",
      "------------------------------------------\n",
      "d8655d54-1311-417a-91f7-c5c6daf8fba22017\n",
      "Query Construction Patterns in PHP 1\n",
      "------------------------------------------\n",
      "67f7f831-711a-43c8-8785-1e09005359b52019\n",
      "Relation-Aware Entity Alignment for Heterogeneous Knowledge Graphs 1\n",
      "------------------------------------------\n",
      "0d6f7fba-7092-46b3-8039-93458dba736b2018\n",
      "Towards End-to-end Spoken Language Understanding 1\n",
      "------------------------------------------\n",
      "1e33b3be-b2ab-46e9-96e8-d4eb4bad6e442018\n",
      "LinkNBed: Multi-Graph Representation Learning with Entity Linkage 1\n",
      "------------------------------------------\n",
      "7654260e-79f9-45c5-9663-d72027cf88f32021\n",
      "Seeking Similarities over Differences: Similarity-based Domain Alignment for Adaptive Object Detection 1\n",
      "------------------------------------------\n",
      "41bf9ed3-85b3-4c90-b015-150e316902532019\n",
      "LXMERT: Learning Cross-Modality Encoder Representations from Transformers 2\n",
      "------------------------------------------\n",
      "d9720b90-d60b-48bc-9df8-87a30b9a60dd2015\n",
      "Training Very Deep Networks 2\n",
      "------------------------------------------\n"
     ]
    }
   ],
   "source": [
    "#First query\n",
    "query1=\"\"\"\n",
    "    MATCH (p:paper)-[:presented]->(ce:ConferenceEdition) \n",
    "    OPTIONAL MATCH (p)<-[c:cite]-(:paper) \n",
    "    WITH ce, p, COUNT(c) AS cnt \n",
    "    ORDER BY ce, cnt DESC\n",
    "    WITH ce, COLLECT({paper: p, cite_nb: cnt}) AS paper_cnt \n",
    "    RETURN ce.confwsEditionId AS confId, paper_cnt[..3] AS top3\n",
    "\"\"\"\n",
    "\n",
    "results = run_query(query1)\n",
    "for row in results:\n",
    "    print(row['confId'])  # Print confId first\n",
    "    for paper in row['top3']:  \n",
    "        print(paper['paper']['title'], paper['cite_nb']) \n",
    "    print(\"------------------------------------------\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'author': 'M. Nießner', 'conference': 'Computer Vision and Pattern Recognition', 'editions': 3}\n",
      "{'author': 'Angela Dai', 'conference': 'Computer Vision and Pattern Recognition', 'editions': 3}\n",
      "{'author': 'Hanwang Zhang', 'conference': 'Computer Vision and Pattern Recognition', 'editions': 2}\n"
     ]
    }
   ],
   "source": [
    "query2=\"\"\"\n",
    "MATCH (a:author)-[:writes]->(p:paper)-[:presented]->(ce:ConferenceEdition)-[:has_edition]->(c:Conference)\n",
    "WITH a, c, COLLECT(DISTINCT ce) AS edi\n",
    "WHERE SIZE(edi) >= 2\n",
    "RETURN a.authorName AS author, c.name AS conference, SIZE(edi) AS editions\n",
    "ORDER BY editions DESC\"\"\"\n",
    "\n",
    "\n",
    "results = run_query(query2)\n",
    "for row in results:\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query3=\"\"\"\n",
    "//with date().year as currentYear\n",
    "WITH 2020 AS currentYear\n",
    "MATCH (j:journal) <-[:published]- (p:paper)\n",
    "WHERE date(p.publicationDate).year IN [currentYear - 1, currentYear - 2]\n",
    "WITH j, COUNT(p) AS citableItems, COLLECT(p) AS citablePapers, currentYear\n",
    "\n",
    "UNWIND citablePapers AS p\n",
    "MATCH (p) <-[:cite]- (cp:paper)\n",
    "WHERE date(cp.publicationDate).year = currentYear\n",
    "\n",
    "RETURN j.journalName,\n",
    "       citableItems,\n",
    "       COUNT(cp) AS citations,\n",
    "       COUNT(cp) * 1.0 / citableItems AS impact_factor\n",
    "\"\"\"\n",
    "\n",
    "results = run_query(query3)\n",
    "for row in results:\n",
    "    print(row)"
   ]
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "query4=\"\"\"\n",
    "MATCH (a:author) -[:writes]-> (p:paper) <-[:cite]- (cp:paper)\n",
    "WITH a, p, COUNT(cp) AS citations\n",
    "ORDER BY citations desc\n",
    "WITH a, COLLECT(citations) as citationList\n",
    "\n",
    "UNWIND RANGE(1, SIZE(citationList)) as h\n",
    "WITH a, h, citationList[h-1] as citationCount\n",
    "WHERE citationCount >= h\n",
    "RETURN a.authorName, MAX(h) AS h_index\n",
    "\"\"\"\n",
    "\n",
    "results = run_query(query4)\n",
    "for row in results:\n",
    "    print(row)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
